'''
Кількість 89 — це перше ціле число з більш ніж однією цифрою, яке відповідає властивості, частково введеній у назву цієї ката. Який сенс говорити "Eureka"? Оскільки ця сума дає те саме число:
89 = 8^1 + 9^2
Наступне число, яке має цю властивість 135
135 = 1^1 + 3^2 + 5^3
Перегляньте цю властивість знову:

ЗАВДАННЯ:
Нам потрібна функція для збору цих чисел, яка може отримати два цілих числа a, b, що визначає діапазон [ , ] [a,b] (inclusive) і виводить список відсортованих чисел у діапазоні, який відповідає описаній вище властивості.

ПРИКЛАДИ:
Давайте подивимося на деякі випадки (input -> output):
1, 10 --> [1, 2, 3, 4, 5, 6, 7, 8, 9]
1, 100 --> [1, 2, 3, 4, 5, 6, 7, 8, 9, 89]

Якщо в діапазоні немає таких чисел [ , ] [a,b] функція має вивести порожній список.
90, 100 --> []
Насолоджуйся цим!!
'''

def find_numbers(a, b):
    result = []
    for number in range(a, b+1):
        if number == sum(int(digit)**(index+1) for index, digit in enumerate(str(number))):
            result.append(number)
    return result


print(f"Eurika! I find numbers! It {find_numbers(10, 10000)}")

# Output Eurika! I find numbers! It [89, 135, 175, 518, 598, 1306, 1676, 2427]

# Круто.