'''
ОПИС:

Ви вмієте робити спіраль? Давайте перевіримо!
Класичне визначення: спіраль — це крива, яка виходить із центральної точки, поступово віддаляючись, обертаючись навколо цієї точки.
Ваше завдання — виконати функцію createSpiral(N), яка отримує ціле число Nта повертає NxN двовимірний масив із числами, 1представленими NxNу вигляді спіралі за годинниковою стрілкою.
Повертає порожній масив, якщо N < 1чи Nне є цілим числом
приклади:
N = 3 Output: [[1,2,3],[8,9,4],[7,6,5]]]
1 2 3
8 9 4
7 6 5

N = 4 Output: [[1,2,3,4],[12,13,14,5],[11,16,15,6],[10,9,8,7]]
1  2  3  4
12 13 14 5
11 16 15 6
10 9  8  7

N = 5 Output: [[1,2,3,4,5],[16,17,18,19,6],[15,24,25,20,7],[14,23,22,21,8],[13,12,11,10,9]]
1  2  3  4  5
16 17 18 19 6
15 24 25 20 7
14 23 22 21 8
13 12 11 10 9
'''

def createSpiral(N):
    if not isinstance(N, int) or N < 1: # чи є N цілим числом та більшим за 0
        return [] # якщо ні, вона повертає порожній масив
    else:
        dx, dy = 0, 1
        x, y = 0, 0 # створюємо NxN масив, заповнений нулями
        spiral = [[0]*N for _ in range(N)] # проходить через кожне число від 1 до N*N, включно, і розміщує це число в масиві, рухаючись по спіралі за годинниковою стрілкою
        for i in range(1, N*N+1): # коли вона досягає краю масиву або клітинки, яка вже була заповнена, вона змінює напрямок на 90 градусів проти годинникової стрілки
            spiral[x][y] = i
            if x+dx >= N or y+dy >= N or x+dx < 0 or y+dy < 0 or spiral[x+dx][y+dy] != 0:
                dx, dy = dy, -dx
            x, y = x+dx, y+dy
        return spiral # повертає створений масив


print(createSpiral(3)) # [[1, 2, 3], [8, 9, 4], [7, 6, 5]]
print(createSpiral(4)) # [[1, 2, 3, 4], [12, 13, 14, 5], [11, 16, 15, 6], [10, 9, 8, 7]]
print(createSpiral(5)) # [[1, 2, 3, 4, 5], [16, 17, 18, 19, 6], [15, 24, 25, 20, 7], [14, 23, 22, 21, 8], [13, 12, 11, 10, 9]]

#
# Ідеально.